app/views/tasks/_form.html.erb

    <%= form.label :assignee_id, '担当者' %>
    <%= form.collection_select(:assignee_id, User.all, :id, :email, { include_blank: true }) %>
---
SELECT `users`.* FROM `users`