app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
    @done_tasks = Task.where(is_done: true)
---
SELECT `tasks`.* FROM `tasks`
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`is_done` = FALSE

  def create
    @task = Task.new(task_params)
    @task.user_id = current_user.id
    @task.email = current_user.email
    @task.user_id = current_user.id
    respond_to do |format|
      if @task.save
---
INSERT INTO `tasks` (`title`, `description`, `is_done`, `created_at`, `updated_at`, `user_id`, `email`, `duedate`, `assignee_id`) VALUES ('テスト', 'テスト', FALSE, '2019-12-23 08:33:08', '2019-12-23 08:33:08', 1, 'a@a', '2019-12-18', 1)

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE `tasks` SET `description` = 'アイ', `updated_at` = '2019-12-19 10:44:41' WHERE `tasks`.`id` = 16

  def destroy
    @task.destroy
---
DELETE FROM `tasks` WHERE `tasks`.`id` = 9

  def completed
    @task = Task.find(params[:id])
    @task.is_done = true
    @task.save
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 19 LIMIT 1
UPDATE `tasks` SET `is_done` = TRUE, `updated_at` = '2019-12-21 12:43:54' WHERE `tasks`.`id` = 19

  def incomplete
    @task = Task.find(params[:id])
    @task.is_done = false
    @task.save
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 3 LIMIT 1
UPDATE `tasks` SET `is_done` = FALSE, `updated_at` = '2019-12-15 16:18:01' WHERE `tasks`.`id` = 3